---
kind: property
id: P:Autodesk.Revit.DB.LayoutRuleFixedDistance.Spacing
source: html/6935a21c-88cc-8e6b-8756-2c5796e814c0.htm
---
# Autodesk.Revit.DB.LayoutRuleFixedDistance.Spacing Property

Get or set spacing of the Beam System.

## Syntax (C#)
```csharp
public double Spacing { get; set; }
```

## Remarks
The value of spacing must be between 0 and 30000.